{"data":{"markdownRemark":{"html":"<!-- markdownlint-disable MD033 -->\n<figure class=\"figure\">\n    <img src=\"./images/split.JPG\" alt=\"Split\"/>\n    <figcaption class=\"figure__caption\">Title</figcaption>\n</figure>\n<h2>Split</h2>\n<p>I started my journey here, flying into Split Airport before taking a taxi into the city. Flights arrive here daily from throughout Europe. I stayed at Silver Gate Hostel for two nights, a simple hostel on the top floor of a building without elevators, which was right across from the entrance to Diocletian’s Palace. In my opinion, this was the best place to start my trip, as it’s a much smaller port and less touristy than Dubrovnik on the other end of the coast. Climb to the top of the bell tower for the best views in town.</p>\n<p>Spend your days here walking the Riva, the main promenade in town, where you’ll find plenty of cafes with outdoor dining, shops and ice cream shops. After you’ve wandered the walls of Diocletian’s Palace, stop by the farmer’s market, which often sets up outside. If you have time, take a tour of the city, which can teach you about the food culture, history, and Game of Thrones landmarks. Stop by the konobas for a bite or grab a slice of pizza from one of the local shops.</p>\n<h2>Hvar</h2>\n<figure class=\"figure\">\n    <img src=\"./images/hvar.JPG\" alt=\"Hvar\"/>\n    <figcaption class=\"figure__caption\">Title</figcaption>\n</figure>\n<p>This town is known for celebrity-spotting, as notable names like Beyonce and Jay Z have been seen here. It’s a beautiful place whether you see some or not. Start with a climb to the top of the hill to the Fortress for the best views at sunset. Then have a casual dinner in town to prepare yourself for a big night out. If you have extra time, visit one of the historic cathedrals and monasteries.</p>\n<p>For its relatively small size, Hvar is a party town and comes to life when the sun goes down. Kiva Bar is odd, but fun, with a tree growing in the middle of it. Get the tequila boom boom shot, which is mixed against a helmet the drinker must wear on their head. Carpe Diem Beach Stipanska is another favorite, a day and night club for lounging off your hangover or partying all night.</p>\n<h2>Mljet</h2>\n<figure class=\"figure\">\n    <img src=\"./images/mljet.JPG\" alt=\"Mljet\"/>\n    <figcaption class=\"figure__caption\">Title</figcaption>\n</figure>\n<p>The southernmost island you might visit is Mljet, home to a national park that makes up most of the land. The population is less than 2,000, so your dining options are limited to a handful of restaurants that may have seasonal hours. It also depends on where you dock, but I found a simple restaurant offering pizza in the Pomena area, a short walk from the entrance to the park. The area was discovered before 6 BC when Greco-Roman geographers arrived to survey the land. The national park includes two large saltwater lakes, one of which is pictured. This is the best island for getting active, whether that means laying out, swimming in the lake, hiking or biking around the island.</p>\n<h2>Makarska</h2>\n<figure class=\"figure\">\n    <img src=\"./images/makarska.JPG\" alt=\"Makarska\"/>\n    <figcaption class=\"figure__caption\">Title</figcaption>\n</figure>\n<p>Large mountains crash into clear ocean in Makarska, a resort town with plenty of shops, restaurants and nightlife. Spend time at the rocky beach, pictured, which is the perfect place to cool off in the summer months. As with other towns on the coast, Makarska has historic churches and monasteries worth a visit. You’ll find more hotels here than elsewhere on the coast, with the exceptions being Split and Dubrovnik, so splurge on a nice place to stay and an authentic, local meal. The only exception is Hostel Yeti, a new accommodation near the nightlife district. End your night at Deep Makarska, a nightclub in a cave.</p>\n<h1><a href=\"https://www.carolineinthecityblog.com/2016/03/17/guide-croatias-dalmatian-coast/\">Source</a></h1>","frontmatter":{"date":"2018-11-03","slug":"where-to-go","title":"Where to Go"}}},"pageContext":{"slug":"where-to-go"}}